# Pandas Loc & Iloc Method

In [134]:
import pandas as pd
import numpy as np

In [77]:
df = pd.read_csv('E:\\docs and imp.videos\\AI video in hindi from yt\\machine learning\\dataset\\STUDENT_10_without_date.csv')

In [78]:
df

   Student ID  Class  Study hrs  Percentage
0        1001     10          2          50
1        1002     10          4          80
2        1003     10          3          60
3        1004     11          0          75
4        1005     11          4          85
5        1006     11         10          55
6        1007     12          4          80
7        1008     12          5          90
8        1009     12          9          60
9        1010     12          6          85

In [79]:
df.loc[0]

Student ID    1001
Class           10
Study hrs        2
Percentage      50
Name: 0, dtype: int64

In [80]:
df.loc[4]

Student ID    1005
Class           11
Study hrs        4
Percentage      85
Name: 4, dtype: int64

In [81]:
df.loc[[0,1]]

   Student ID  Class  Study hrs  Percentage
0        1001     10          2          50
1        1002     10          4          80

In [82]:
df.loc[[2,4]]

   Student ID  Class  Study hrs  Percentage
2        1003     10          3          60
4        1005     11          4          85

In [83]:
df.loc[4,'Class']

11

In [84]:
df.loc[9,'Class']

12

In [85]:
df.loc[4,'Student ID']

1005

In [86]:
df.loc[0:4,'Class']

0    10
1    10
2    10
3    11
4    11
Name: Class, dtype: int64

In [106]:
df.loc[0:2,'Study hrs']

0    2
1    4
2    3
Name: Study hrs, dtype: int64

In [121]:
df.loc[[True,True,True,False,True,True,True,False,True,True]]

   Student ID  Class  Study hrs  Percentage
0        1001     10          2          50
1        1002     10          4          80
2        1003     10          3          60
4        1005     11          4          85
5        1006     11         10          55
6        1007     12          4          80
8        1009     12          9          60
9        1010     12          6          85

In [89]:
df.loc[df['Class']<11]

   Student ID  Class  Study hrs  Percentage
0        1001     10          2          50
1        1002     10          4          80
2        1003     10          3          60

In [90]:
df.loc[df['Class']<11,['Percentage']]

   Percentage
0          50
1          80
2          60

In [91]:
df.iloc[0]

Student ID    1001
Class           10
Study hrs        2
Percentage      50
Name: 0, dtype: int64

In [92]:
df.iloc[:,0]

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64

In [93]:
df.iloc[:,1]

0    10
1    10
2    10
3    11
4    11
5    11
6    12
7    12
8    12
9    12
Name: Class, dtype: int64

In [94]:
df.iloc[:,2]

0     2
1     4
2     3
3     0
4     4
5    10
6     4
7     5
8     9
9     6
Name: Study hrs, dtype: int64

In [95]:
df.iloc[:,3]

0    50
1    80
2    60
3    75
4    85
5    55
6    80
7    90
8    60
9    85
Name: Percentage, dtype: int64

In [126]:
df.iloc[:,3]

0    50
1    80
2    60
3    75
4    85
5    55
6    80
7    90
8    60
9    85
Name: Percentage, dtype: int64

In [97]:
df.iloc[[0,2]]

   Student ID  Class  Study hrs  Percentage
0        1001     10          2          50
2        1003     10          3          60

In [127]:
df.iloc[[2,6]]

   Student ID  Class  Study hrs  Percentage
2        1003     10          3          60
6        1007     12          4          80

In [133]:
df.iloc[[True,True,False,False,True,True,True,False,True,True]]

   Student ID  Class  Study hrs  Percentage
0        1001     10          2          50
1        1002     10          4          80
4        1005     11          4          85
5        1006     11         10          55
6        1007     12          4          80
8        1009     12          9          60
9        1010     12          6          85